Repository: 84000/data-translation-memory
Catalog: toh141-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས།
en: The Noble Dhāraṇī of the Six Gates

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Mañjuśrī Kumārabhūta.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཁྱམས་གནས་གཙང་མའི་སྟེང་ནམ་མཁའི་དཀྱིལ་ན་གནས་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་རྣམ་པར་ཕྱེ་བར་སྤྲས་པ་ན། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་གྲངས་མེད་པ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Bhagavān was dwelling together with an assembly of innumerable bodhisattvas in a pavilion ornately decorated with the seven kinds of precious jewels that was located in the firmament of the sky above Śuddhāvāsa.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར། སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཟུང་ཤིག །དེ་ནི་འདི་ལྟ་སྟེ།
en: On that occasion, the Bhagavān said to the bodhisattvas, “Children of a noble family, may you uphold The Dhāraṇī of the Six Gates for the benefit and well-being of the whole world. It is as follows:

source: འཁོར་བ་ནས་འཁོར་བའི་སྐྱེ་གནས་གཞན་དག་ཏུ་བདག་གིས་སྡུག་བསྔལ་གང་ཅི་མྱོང་བ་དེ་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་ཉིད་མི་ཤེས་པའི་མཚན་ཉིད་དུ་མ་གྱུར་ཅིག །
en: “As I pass through life after life in saṃsāra, whatever suffering I experience, may it not be characterized by my not understanding that it is the same for all beings.

source: བདག་གིས་འཇིག་རྟེན་པའི་ཕུན་སུམ་ཚོགས་པའི་བདེ་བ་གང་ཅི་མྱོང་བ་དེ།
en: “Whatever happiness due to worldly success I experience,

source: སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་ཡོངས་སུ་ཤེས་པར་བྱེད་པར་སྤྱོད་པར་གྱུར་ཅིག །
en: may I make use of it in common with all beings to bring about thorough understanding.

source: བདག་གིས་སྡིག་པ་མི་དགེ་བའི་ལས་གང་ཅི་བྱས་པ་དེ།
en: “Whatever misdeeds and non-virtuous actions I have done,

source: སོ་སོར་བཤགས་པ་བླ་ན་མེད་པས་སོ་སོར་མ་བཤགས་པར་མ་གྱུར་ཅིག །
en: may I not fail to confess each one of them through unsurpassed confession.

source: བདག་གིས་བདུད་ཀྱི་ལས་གང་ཅི་བྱས་པ་དེ་ཡོངས་སུ་བྱེད་པ།བླ་ན་མེད་པས་ཡོངས་སུ་མི་ཤེས་པར་མ་གྱུར་ཅིག །
en: “Whatever demonic actions have been done to me, may I not fail to thoroughly understand them through unsurpassed thorough understanding.

source: བདག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་ཡང་རུང་། གང་ཅི་ཡོད་པ་དེ་ཐམས་ཅད་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་འབྲས་བུར་གྱུར་ཅིག །
en: “Whatever roots of virtue I may have, both mundane and supramundane, endowed with the perfections, may they become the fruit of unsurpassable wisdom for all beings.

source: བདག་གི་རྣམ་པར་གྲོལ་བ་གང་ཅི་ཡོད་པ་དེས།སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་ཐར་བར་གྱུར་ཅིག །འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་གནས་པར་མ་གྱུར་ཅིག །
en: “Whatever liberation I may have, through it may all sentient beings be released. May I stay neither in saṃsāra nor in nirvāṇa.

source: ཏདྱ་ཐ། ཨོཾ་ཀྵ་མེ་ཀྵ་མེ། ཀྵཱན་ཏེ་ཀྵཱན་ཏེ། ད་མེ་ད་མེ། དཱན་ཏེ་དཱན་ཏེ། བྷ་དྲེ་བྷ་དྲེ། སུ་བྷ་དྲེ་སུ་བྷ་དྲེ། ཙན་དྲེ་ཙན་དྲེ། སུ་ཙན་དྲེ་སུ་ཙན་དྲེ། ཙན་དྲ་ཀི་ར་ཎེ། ཙན་དྲ་བ་ཏི། ཏེ་ཛོ་བ་ཏི། ཡ་ཤོ་བ་ཏི།ངྷརྨ་བ་ཏི། བྲཧྨ་བ་ཏི། སརྦ་ཀླེ་ཤ་བི་ཤོ་དྷ་ནི། སརྦ་ཨརྠ་སཱ་ངྷ་ནི། སརྦ་ཨརྠ་པྲ་ཤ་མ་ནེ། པ་ར་མཱརྠ་དྷ་ནི། ཀཱ་ཡ་བི་ཤོ་ངྷ་ནི། བཱ་ཀ་བི་ཤོ་ངྷ་ནི། མ་ནཿསྃ་ཤོ་ངྷ་ནི་སྭཱ་ཧཱ།
en: tadyathā oṃ kṣame kṣame kṣānte kṣānte dame dame dānte dānte bhadre bhadre subhadre subhadre candre candre sucandre sucandre candrakiraṇe candravati tejovati yaśovati dharmavati brahmavati sarva­kleśa­viśodhani sarvārtha­sādhani sarvānartha­praśamani paramārtha­sādhani kāyaviśodhani vāgviśodhani manaḥsaṃśodhani svāhā

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟར་ན་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས་འདི། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་བཀླགས་ན། དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་བྱང་ནས། སྐྱེ་བ་བདུན་གྱི་བར་དུ་དེ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: “Therefore, children of a noble family, if any sons or daughters of a noble family recite The Dhāraṇī of the Six Gates three times by day and three times by night, then, having purified all their karmic obscurations, they will remember their previous lives up to seven lifetimes and will swiftly and fully awaken to unsurpassed perfect buddhahood.”

source: །བཅོམ་ལྡན་འདས་དགྱེས་ཤིང་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: When the delighted Bhagavān had spoken these words, the assembly of bodhisattvas, and the world with its devas, humans, asuras, and gandharvas rejoiced in what the Bhagavān had said.

source: འཕགས་པ་སྒོ་དྲུག་པ་ཞེས་བྱ་བའི་གཟུངས་རྫོགས་སྷོ།། །།
en: Thus ends “The Noble Dhāraṇī of the Six Gates.”

source: ཤུ་བྷམ་སྟུ་སརྦ་ཛ་ག་ཏཱཾ། །།ཡེ་ངྷ་རྨ་ཧེ་ཏུ་པྲ་བྷ་ཝཱ་ཧེ་ཏུནྟེ་ཥན་ཏ་ཐཱ་ག་ཏོ་ཧྱ་བ་དཏ།ཏེ་ཥཱ་ཉྩ་ཡོ་ནི་རོ་ངྷ་ཨེ་ཝཾ་བཱ་དཱི་མ་ཧཱ་ཤྲ་མ་ཎཿ།། མཾ་ག་ལཾ་བྷ་བྷ་བནྟུ།། །།
en: śubham astu sarvajagatām ye dharmā hetuprabhavā hetuṃ teṣāṃ tathāgato hy avadat teṣāṃ ca yo nirodha evaṃvādī mahāśramaṇaḥ maṅgalaṃ bhavatu
